ImBonkers/nuttx/arch/arm/src/stm32n6/stm32_aton_hw.c
/****************************************************************************
 * arch/arm/src/stm32n6/stm32_aton_hw.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Native ATON NPU register programming for STM32N6.
 * Reimplements the 7 LL_ATON functions that STEdgeAI-generated model
 * code calls, using pure NuttX register access (putreg32/getreg32).
 * Replaces the entire LL_ATON runtime (~15K lines) with ~800 lines.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <nuttx/cache.h>

#include "arm_internal.h"
#include "stm32_aton.h"
#include "stm32_aton_hw.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define ATON_MIN(a, b)  ((a) < (b) ? (a) : (b))

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Saved CONVACC CTRL values for EnableUnits (must preserve config bits) */

static uint32_t g_convacc_ctrl[ATON_CONVACC_NUM];

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: aton_disable_clr_confclr
 *
 * Description:
 *   Disable + clear + config-clear a unit via its CTRL register.
 *   Sequence: CLR=1 → poll CLR==0 → CONFCLR=1 → poll CONFCLR==0
 *
 ****************************************************************************/

static void aton_disable_clr_confclr(uintptr_t ctrl_addr)
{
  /* Write clean CLR=1 (all other bits 0, matching original LL_ATON) */

  putreg32((1u << 1), ctrl_addr);

  /* Poll until CLR auto-clears */

  while (getreg32(ctrl_addr) & (1u << 1));

  /* Write clean CONFCLR=1 */

  putreg32((1u << 30), ctrl_addr);

  /* Poll until CONFCLR auto-clears */

  while (getreg32(ctrl_addr) & (1u << 30));
}

/****************************************************************************
 * Name: get_arith_hwop
 *
 * Description:
 *   Convert LL_Arithacc_Op enum to hardware operation code.
 *
 ****************************************************************************/

static uint32_t get_arith_hwop(LL_Arithacc_Op op)
{
  /* LL_ATON enum values map 1:1 minus 1 to HW codes for AFFINE through
   * CLIP.  AFFINE=1 → HW 0, MIN=2 → HW 1, etc.
   */

  if (op >= ARITH_AFFINE && op <= ARITH_CLIP)
    {
      return (uint32_t)(op - 1);
    }

  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: LL_ATON_EnableClock
 *
 * Description:
 *   Enable a clock gate bit in CLKCTRL BGATES register.
 *
 ****************************************************************************/

void LL_ATON_EnableClock(unsigned int clock)
{
  uintptr_t addr = ATON_CLKCTRL_BASE + ATON_CLKCTRL_BGATES;
  uint32_t t;

  t = getreg32(addr);
  t |= (1u << clock);
  putreg32(t, addr);
}

/****************************************************************************
 * Name: LL_ATON_DisableClock
 *
 * Description:
 *   Disable a clock gate bit in CLKCTRL BGATES register.
 *
 ****************************************************************************/

void LL_ATON_DisableClock(unsigned int clock)
{
  uintptr_t addr = ATON_CLKCTRL_BASE + ATON_CLKCTRL_BGATES;
  uint32_t t;

  t = getreg32(addr);
  t &= ~(1u << clock);
  putreg32(t, addr);
}

/****************************************************************************
 * Name: LL_Streng_TensorInit
 *
 * Description:
 *   Program a streaming engine for data transfer.
 *
 ****************************************************************************/

int LL_Streng_TensorInit(int id,
                         const LL_Streng_TensorInitTypeDef *conf, int n)
{
  uintptr_t base;
  uint32_t ctrl;
  uint32_t strd;
  uint32_t cid_cache;
  uint32_t event;
  uint32_t t;
  int ch_bits[3] = {0, 0, 0};
  int nbits_in;
  int nbits_out;
  int io_case;
  int bits[3];
  unsigned line_offset;

  if (id >= ATON_STRENG_NUM || n != 1)
    {
      return -1;
    }

  base = ATON_STRENG_BASE(id);

  /* Enable clock gate */

  LL_ATON_EnableClock(ATON_CLKB_STRENG(id));

  /* Build CTRL register */

  ctrl = 0;
  if (conf->dir)
    {
      ctrl |= STRENG_CTRL_DIR;
    }

  if (conf->raw)
    {
      ctrl |= STRENG_CTRL_RAW;
    }

  if (conf->raw_out)
    {
      ctrl |= STRENG_CTRL_RAW_OUT;
    }

  if (conf->noblk)
    {
      ctrl |= STRENG_CTRL_NOBLK;
    }

  if (conf->noinc)
    {
      ctrl |= STRENG_CTRL_NOINC;
    }

  if (conf->frame_tot_cnt == 1)
    {
      ctrl |= STRENG_CTRL_SINGLE;
    }

  if (conf->continuous)
    {
      ctrl |= STRENG_CTRL_CONT;
    }

  if (conf->align_right)
    {
      ctrl |= STRENG_CTRL_LSBMODE;
      if (!conf->nbits_unsigned)
        {
          ctrl |= STRENG_CTRL_SIGNEXT;
        }
    }

  /* Compute SIZE0/SIZE1/SIZE2 channel bits */

  nbits_in  = conf->nbits_in;
  nbits_out = conf->nbits_out;
  strd = 0;

  io_case = ((conf->dir != 0) << 1) |
            (conf->dir == 0 ? (nbits_in <= nbits_out) :
                              (nbits_in < nbits_out));

  switch (io_case)
    {
      case 0: /* bus→stream, in > out */
        if (conf->mem_lsb)
          {
            strd |= ((nbits_in - nbits_out) << STRENG_STRD_FGAP_SHIFT)
                     & STRENG_STRD_FGAP_MASK;
          }
        else
          {
            strd |= ((nbits_in - nbits_out) << STRENG_STRD_BGAP_SHIFT)
                     & STRENG_STRD_BGAP_MASK;
          }

