ImBonkers/nuttx/arch/arm/src/stm32n6/stm32_aton_hw.c
        nbits_in = nbits_out;

        /* Fall through */

      case 1: /* bus→stream, in <= out */
        bits[0] = ATON_MIN(8, nbits_in);
        bits[1] = nbits_in > 8  ? ATON_MIN(8, nbits_in - 8)  : 0;
        bits[2] = nbits_in > 16 ? ATON_MIN(8, nbits_in - 16) : 0;
        if (conf->align_right)
          {
            ch_bits[0] = bits[0];
            ch_bits[1] = bits[1];
            ch_bits[2] = bits[2];
          }
        else
          {
            if (nbits_out > 16)
              {
                ch_bits[2] = bits[0];
                ch_bits[1] = bits[1];
                ch_bits[0] = bits[2];
              }
            else if (nbits_out > 8)
              {
                ch_bits[1] = bits[0];
                ch_bits[0] = bits[1];
              }
            else
              {
                ch_bits[0] = bits[0];
              }
          }
        break;

      case 3: /* stream→bus, in < out */
        if (conf->mem_lsb)
          {
            strd |= ((nbits_out - nbits_in) << STRENG_STRD_FGAP_SHIFT)
                     & STRENG_STRD_FGAP_MASK;
          }
        else
          {
            strd |= ((nbits_out - nbits_in) << STRENG_STRD_BGAP_SHIFT)
                     & STRENG_STRD_BGAP_MASK;
          }

        nbits_out = nbits_in;

        /* Fall through */

      case 2: /* stream→bus, in >= out */
        bits[0] = ATON_MIN(8, nbits_out);
        bits[1] = nbits_out > 8  ? ATON_MIN(8, nbits_out - 8)  : 0;
        bits[2] = nbits_out > 16 ? ATON_MIN(8, nbits_out - 16) : 0;
        if (conf->align_right)
          {
            ch_bits[0] = bits[0];
            ch_bits[1] = bits[1];
            ch_bits[2] = bits[2];
          }
        else
          {
            if (conf->nbits_in > 16)
              {
                ch_bits[2] = bits[0];
                ch_bits[1] = bits[1];
                ch_bits[0] = bits[2];
              }
            else if (conf->nbits_in > 8)
              {
                ch_bits[1] = bits[0];
                ch_bits[0] = bits[1];
              }
            else
              {
                ch_bits[0] = bits[0];
              }
          }
        break;
    }

  ctrl |= (ch_bits[0] << STRENG_CTRL_SIZE0_SHIFT) & STRENG_CTRL_SIZE0_MASK;
  ctrl |= (ch_bits[1] << STRENG_CTRL_SIZE1_SHIFT) & STRENG_CTRL_SIZE1_MASK;
  ctrl |= (ch_bits[2] << STRENG_CTRL_SIZE2_SHIFT) & STRENG_CTRL_SIZE2_MASK;

  putreg32(ctrl, base + ATON_STRENG_CTRL);

  /* ADDR = base + offset_start */

  putreg32(conf->addr_base.i + conf->offset_start,
           base + ATON_STRENG_ADDR);

  /* FSIZE */

  cid_cache = 0;

  if (conf->raw)
    {
      if (conf->frame_count)
        {
          t = conf->frame_count;
        }
      else
        {
          unsigned pixel_bits = conf->dir == 0 ? conf->nbits_in
                                               : conf->nbits_out;
          t = (LL_Streng_len(conf) * 8) / pixel_bits;
        }

      putreg32(t, base + ATON_STRENG_FSIZE);
    }
  else
    {
      t = (conf->fwidth & 0xFFFF) |
          ((conf->fheight & 0xFFFF) << 16);
      putreg32(t, base + ATON_STRENG_FSIZE);

      line_offset = conf->line_offset == 0
                    ? conf->fwidth * conf->batch_offset
                    : conf->line_offset;
      strd |= (line_offset << STRENG_STRD_LOFF_SHIFT)
              & STRENG_STRD_LOFF_MASK;

      /* LOFF MSB in CID_CACHE for large line offsets */

      cid_cache |= ((line_offset >> 16) << STRENG_CID_LOFF_MSB_SHIFT)
                   & STRENG_CID_LOFF_MSB_MASK;

      /* DEPTH register */

      t = (conf->batch_depth & 0xFFFF) |
          ((conf->batch_offset & 0xFFFF) << 16);
      putreg32(t, base + ATON_STRENG_DEPTH);
    }

  /* Frame offset */

  putreg32(conf->frame_offset, base + ATON_STRENG_FOFFSET);

  /* Frame repeat */

  putreg32(conf->loop_offset, base + ATON_STRENG_FRPTOFF);
  putreg32(conf->frame_loop_cnt, base + ATON_STRENG_FRAME_RPT);

  /* LIMITEN */

  t = STRENG_LIMITEN_FRAMELIMIT;
  putreg32(t, base + ATON_STRENG_LIMITEN);

  if (conf->offset_limit != 0)
    {
      t |= STRENG_LIMITEN_ADDRLIMIT | STRENG_LIMITEN_STOPPREFTC;
      putreg32(t, base + ATON_STRENG_LIMITEN);
      putreg32(conf->addr_base.i + conf->offset_limit - 1,
               base + ATON_STRENG_LIMITADDR);
    }

  /* LIMIT (total frame count) */

  putreg32(conf->frame_tot_cnt, base + ATON_STRENG_LIMIT);

  /* CID_CACHE */

  cid_cache |= (conf->bus_cid << STRENG_CID_CID_SHIFT)
                & STRENG_CID_CID_MASK;
  if (conf->cacheable)
    {
      cid_cache |= STRENG_CID_CACHEABLE;
    }

  if (conf->cache_allocate)
    {
      cid_cache |= STRENG_CID_ALLOC;
    }

  if (conf->bus_pfetch)
    {
      cid_cache |= STRENG_CID_PFETCH;
    }

  cid_cache |= (conf->cache_linesize << STRENG_CID_LINESIZE_SHIFT)
                & STRENG_CID_LINESIZE_MASK;

  /* EVENT — do NOT set EN_BUFBL here.  EN_BUFBL causes the STRENG to
   * stall waiting for event acknowledgment, breaking the HW pipeline.
   * STRENG completion is detected by polling CTRL.RUNNING instead.
   */

  event = 0;
  if (conf->dir == 1)
    {
      event |= STRENG_EVENT_EN_OFLOW_FRM;
    }

  event |= STRENG_EVENT_EN_ILLCFG;

  if (conf->dir == 0 && conf->sync_with_other)
    {
      event |= STRENG_EVENT_FRMTRG_EN;
      event |= (conf->sync_dma << STRENG_EVENT_FRMTRG_SRC_SHIFT)
               & STRENG_EVENT_FRMTRG_SRC_MASK;
    }

  /* POS (gap cycles = 0) */

  putreg32(0, base + ATON_STRENG_POS);

  /* Write deferred registers */

  putreg32(strd, base + ATON_STRENG_STRD);
  putreg32(cid_cache, base + ATON_STRENG_CID_CACHE);
  putreg32(event, base + ATON_STRENG_EVENT);

  return 0;
}

/****************************************************************************
 * Name: LL_Convacc_Init
 *
 * Description:
 *   Program a convolution accelerator unit.
 *
 ****************************************************************************/

int LL_Convacc_Init(int id, const LL_Convacc_InitTypeDef *conf)
{
  uintptr_t base;
  uint32_t ctrl;
  uint32_t t;
  int p_top;
  int p_bot;
  int p_left;
  int p_right;
  int z_top;
  int z_bot;
  int z_left;
  int z_right;

  if (id >= ATON_CONVACC_NUM)
    {
      return -1;
    }

  base = ATON_CONVACC_BASE(id);

  LL_ATON_EnableClock(ATON_CLKB_CONVACC(id));

