ImBonkers/nuttx/arch/arm/src/stm32n6/stm32_aton_hw.c
  /* CTRL register */

  ctrl = 0;
  if (!conf->accumulate)
    {
      ctrl |= CONVACC_CTRL_NOSUM;
    }

  if (!conf->accumulate_first)
    {
      ctrl |= CONVACC_CTRL_NO1SUM;
    }

  if (conf->accumulate_gen_first)
    {
      ctrl |= CONVACC_CTRL_GEN1SUM;
    }

  ctrl |= (conf->afilt_mode << CONVACC_CTRL_AFILTMODE_SHIFT)
           & CONVACC_CTRL_AFILTMODE_MASK;
  ctrl |= (conf->simd << CONVACC_CTRL_SIMD_SHIFT)
           & CONVACC_CTRL_SIMD_MASK;

  if (conf->kt1_mode)
    {
      ctrl |= CONVACC_CTRL_KT1;
    }

  ctrl |= (conf->kseten << CONVACC_CTRL_KSETEN_SHIFT)
           & CONVACC_CTRL_KSETEN_MASK;

  if (conf->f_unsigned)
    {
      ctrl |= CONVACC_CTRL_FUNSIGNED;
    }

  if (conf->k_unsigned)
    {
      ctrl |= CONVACC_CTRL_KUNSIGNED;
    }

  if (conf->fstat)
    {
      ctrl |= CONVACC_CTRL_FSTAT;
    }

  if (conf->deepmode)
    {
      ctrl |= CONVACC_CTRL_DEEPMODE;
    }

  if (conf->dss2mode)
    {
      ctrl |= CONVACC_CTRL_DSS2MODE;
    }

  putreg32(ctrl, base + ATON_CONVACC_CTRL);
  g_convacc_ctrl[id] = ctrl;

  /* AFILT register */

  if (conf->afilt_mode != AFILT_MODE_NONE)
    {
      t = (conf->afilt_tot   << CONVACC_AFILT_TOT_SHIFT)   |
          (conf->afilt_first << CONVACC_AFILT_FIRST_SHIFT) |
          (conf->afilt_last  << CONVACC_AFILT_LAST_SHIFT);
    }
  else
    {
      t = 0x00000001;  /* AFILT_DT: TOT=1 (default) */
    }

  putreg32(t, base + ATON_CONVACC_AFILT);

  /* KFILT register */

  if (conf->kfilt_tot > 0)
    {
      t = (conf->kfilt_tot   << CONVACC_KFILT_TOT_SHIFT)   |
          (conf->kfilt_first << CONVACC_KFILT_FIRST_SHIFT) |
          (conf->kfilt_last  << CONVACC_KFILT_LAST_SHIFT);
    }
  else
    {
      t = 0x00000001;  /* KFILT_DT: TOT=1 (single kernel set) */
    }

  putreg32(t, base + ATON_CONVACC_KFILT);

  /* DFORMAT register */

  t = 0;
  t |= (conf->rounding_f  << CONVACC_DFORMAT_FROUND_SHIFT);
  t |= (conf->saturation_f << CONVACC_DFORMAT_FSAT_SHIFT);
  t |= (conf->round_mode_f << CONVACC_DFORMAT_FRNDMODE_SHIFT);
  t |= (conf->inbytes_f << CONVACC_DFORMAT_FBYTES_SHIFT)
       & CONVACC_DFORMAT_FBYTES_MASK;
  t |= (ATON_SHIFT_ENCODE(conf->shift_f) << CONVACC_DFORMAT_FSHIFT_SHIFT)
       & CONVACC_DFORMAT_FSHIFT_MASK;
  t |= (conf->raw_o << CONVACC_DFORMAT_RAW_SHIFT);
  t |= (conf->shift_a << CONVACC_DFORMAT_INSHIFT_SHIFT)
       & CONVACC_DFORMAT_INSHIFT_MASK;
  t |= (conf->rounding_o << CONVACC_DFORMAT_ROUND_SHIFT);
  t |= (conf->saturation_o << CONVACC_DFORMAT_SAT_SHIFT);
  t |= (((conf->relu_mode_o << 1) | conf->round_mode_o)
        << CONVACC_DFORMAT_ORNDMODE_SHIFT) & CONVACC_DFORMAT_ORNDMODE_MASK;
  t |= (conf->outbytes_o << CONVACC_DFORMAT_OBYTES_SHIFT)
       & CONVACC_DFORMAT_OBYTES_MASK;
  t |= (conf->shift_o << CONVACC_DFORMAT_OUTSHIFT_SHIFT);
  putreg32(t, base + ATON_CONVACC_DFORMAT);

  /* FFORMAT register (width x height) */

  t = ((conf->fWidth * conf->batchDepth) & 0xFFFF) |
      ((conf->fHeight & 0xFFFF) << 16);
  putreg32(t, base + ATON_CONVACC_FFORMAT);

  /* KFORMAT register */

  t = 0;
  t |= (conf->kernelWidth  << CONVACC_KFORMAT_WIDTH_SHIFT)
       & CONVACC_KFORMAT_WIDTH_MASK;
  t |= (conf->kernelHeight << CONVACC_KFORMAT_HEIGHT_SHIFT)
       & CONVACC_KFORMAT_HEIGHT_MASK;
  t |= (conf->batchDepth   << CONVACC_KFORMAT_BTCDEPTH_SHIFT)
       & CONVACC_KFORMAT_BTCDEPTH_MASK;
  t |= (conf->nKernels     << CONVACC_KFORMAT_NR_SHIFT)
       & CONVACC_KFORMAT_NR_MASK;
  putreg32(t, base + ATON_CONVACC_KFORMAT);

  /* Compute HW padding (capped at kernel-1 and max 2) */

  p_top   = ATON_MIN(ATON_MIN((int)conf->top_padding,
                              (int)conf->kernelHeight - 1), 2);
  p_bot   = ATON_MIN(ATON_MIN((int)conf->bot_padding,
                              (int)conf->kernelHeight - 1), 2);
  p_left  = ATON_MIN(ATON_MIN((int)conf->left_padding,
                              (int)conf->kernelWidth - 1), 2);
  p_right = ATON_MIN(ATON_MIN((int)conf->right_padding,
                              (int)conf->kernelWidth - 1), 2);

  /* deepmode/dss2mode/zfbias force HW padding to 0 */

  if (conf->deepmode || conf->dss2mode || conf->zfbias)
    {
      p_top = p_bot = p_left = p_right = 0;
    }

  /* Remaining padding → zero-frame */

  z_top   = conf->top_padding   - p_top;
  z_bot   = conf->bot_padding   - p_bot;
  z_left  = conf->left_padding  - p_left;
  z_right = conf->right_padding - p_right;

  /* ZFRAME register */

  t = ((z_top                      << CONVACC_ZFRAME_TOP_SHIFT)
                                    & CONVACC_ZFRAME_TOP_MASK)    |
      ((z_bot                      << CONVACC_ZFRAME_BOTTOM_SHIFT)
                                    & CONVACC_ZFRAME_BOTTOM_MASK) |
      (((z_left * conf->batchDepth) << CONVACC_ZFRAME_LEFT_SHIFT)
                                    & CONVACC_ZFRAME_LEFT_MASK)   |
      (((z_right * conf->batchDepth) << CONVACC_ZFRAME_RIGHT_SHIFT)
                                    & CONVACC_ZFRAME_RIGHT_MASK);
  putreg32(t, base + ATON_CONVACC_ZFRAME);

  /* SAMPLE register (strides + HW padding) */

  t = 0;
  t |= (p_top   << CONVACC_SAMPLE_TPAD_SHIFT) & CONVACC_SAMPLE_TPAD_MASK;
  t |= (p_bot   << CONVACC_SAMPLE_BPAD_SHIFT) & CONVACC_SAMPLE_BPAD_MASK;
  t |= (p_left  << CONVACC_SAMPLE_LPAD_SHIFT) & CONVACC_SAMPLE_LPAD_MASK;
  t |= (p_right << CONVACC_SAMPLE_RPAD_SHIFT) & CONVACC_SAMPLE_RPAD_MASK;
  t |= (conf->hstride << CONVACC_SAMPLE_HSTRD_SHIFT)
       & CONVACC_SAMPLE_HSTRD_MASK;
  t |= (conf->vstride << CONVACC_SAMPLE_VSTRD_SHIFT)
       & CONVACC_SAMPLE_VSTRD_MASK;
  if (conf->fstat)
    {
      t |= (conf->fstatcnt << CONVACC_SAMPLE_FSTATCNT_SHIFT)
           & CONVACC_SAMPLE_FSTATCNT_MASK;
    }

  putreg32(t, base + ATON_CONVACC_SAMPLE);

  /* FHCROP, FVCROP registers */

  t = 0;
  if (conf->left_crop > 0)
    {
      t |= ((conf->left_crop * conf->batchDepth)
            << CONVACC_FHCROP_LEFT_SHIFT) & CONVACC_FHCROP_LEFT_MASK;
    }

  if (conf->right_crop > 0)
    {
      t |= ((conf->right_crop * conf->batchDepth + conf->batchDepth - 1)
            << CONVACC_FHCROP_RIGHT_SHIFT) & CONVACC_FHCROP_RIGHT_MASK;
    }

  putreg32(t, base + ATON_CONVACC_FHCROP);

  t = 0;
  if (conf->top_crop > 0)
    {
      t |= (conf->top_crop << CONVACC_FVCROP_TOP_SHIFT)
           & CONVACC_FVCROP_TOP_MASK;
    }

  if (conf->bot_crop > 0)
    {
      t |= (conf->bot_crop << CONVACC_FVCROP_BOTTOM_SHIFT)
           & CONVACC_FVCROP_BOTTOM_MASK;
    }

  putreg32(t, base + ATON_CONVACC_FVCROP);

