ImBonkers/nuttx/arch/arm/src/stm32n6/stm32_aton_hw.c
  /* FSUB + VSHIFT */

  if (conf->fsub != 0 || conf->vshift != 0)
    {
      t = ((conf->fsub << CONVACC_FSUB_FSUB_SHIFT)
           & CONVACC_FSUB_FSUB_MASK) |
          ((conf->vshift << CONVACC_FSUB_VSHIFT_SHIFT)
           & CONVACC_FSUB_VSHIFT_MASK);
      putreg32(t, base + ATON_CONVACC_FSUB);
    }

  /* ZFBIAS */

  if (conf->zfbias != 0)
    {
      t = (conf->zfbias << CONVACC_ZFBIAS_ZFBIAS_SHIFT)
          & CONVACC_ZFBIAS_ZFBIAS_MASK;
      putreg32(t, base + ATON_CONVACC_ZFBIAS);
    }

  return 0;
}

/****************************************************************************
 * Name: LL_Arithacc_Init
 *
 * Description:
 *   Program an arithmetic accelerator unit.
 *   Currently supports scalar mode only (all current model epochs use it).
 *
 ****************************************************************************/

int LL_Arithacc_Init(int id, const LL_Arithacc_InitTypeDef *conf)
{
  uintptr_t base;
  uint32_t ctrl;
  uint32_t t;

  if (id >= ATON_ARITH_NUM)
    {
      return -1;
    }

  base = ATON_ARITH_BASE(id);

  LL_ATON_EnableClock(ATON_CLKB_ARITH(id));

  /* Reset CTRL */

  putreg32(0, base + ATON_ARITH_CTRL);

  /* Build CTRL register */

  ctrl = 0;

  /* Counter enables: scalar mode → counters off */

  if (!conf->scalar)
    {
      ctrl |= ARITH_CTRL_CNT1;
      if (conf->bcast == ARITH_BCAST_CHAN)
        {
          ctrl |= ARITH_CTRL_CNT2 | ARITH_CTRL_CNT3;
        }
    }

  if (conf->rounding_o)
    {
      ctrl |= ARITH_CTRL_ROUND;
    }

  if (conf->saturation_o)
    {
      ctrl |= ARITH_CTRL_SAT;
    }

  ctrl |= (((conf->relu_mode_o << 1) | conf->round_mode_o)
           << ARITH_CTRL_ORNDMODE_SHIFT) & ARITH_CTRL_ORNDMODE_MASK;
  ctrl |= (conf->outbytes_o << ARITH_CTRL_OBYTES_SHIFT)
          & ARITH_CTRL_OBYTES_MASK;

  /* Coefficient types: scalar=0 means vector (COEFFA/B/C=1) */

  if (!conf->scalar)
    {
      ctrl |= ARITH_CTRL_COEFFA | ARITH_CTRL_COEFFB | ARITH_CTRL_COEFFC;
    }

  if (conf->dualinput)
    {
      ctrl |= ARITH_CTRL_DUALIN;
    }

  if (conf->combinebc)
    {
      ctrl |= ARITH_CTRL_COMBINEBC;
    }

  if (conf->clipout)
    {
      ctrl |= ARITH_CTRL_CLIPOUT;
    }

  ctrl |= (get_arith_hwop(conf->operation) << ARITH_CTRL_OP_SHIFT)
          & ARITH_CTRL_OP_MASK;

  if (conf->operation == ARITH_NOT_X)
    {
      ctrl |= ARITH_CTRL_LOGICALOP;
    }

  putreg32(ctrl, base + ATON_ARITH_CTRL);

  /* INSHIFTER register */

  t = 0;
  t |= (conf->inbytes_x << ARITH_INSHIFTER_FBYTESX_SHIFT)
       & ARITH_INSHIFTER_FBYTESX_MASK;
  t |= (ATON_SHIFT_ENCODE(conf->shift_x) << ARITH_INSHIFTER_FSHIFTX_SHIFT)
       & ARITH_INSHIFTER_FSHIFTX_MASK;
  t |= (conf->rounding_x  << ARITH_INSHIFTER_FROUNDX_SHIFT);
  t |= (conf->saturation_x << ARITH_INSHIFTER_FSATX_SHIFT);
  t |= (conf->round_mode_x << ARITH_INSHIFTER_FRNDMODEX_SHIFT)
       & ARITH_INSHIFTER_FRNDMODEX_MASK;
  t |= (conf->outbytes_x << ARITH_INSHIFTER_FOBYTESX_SHIFT)
       & ARITH_INSHIFTER_FOBYTESX_MASK;
  t |= (conf->inbytes_y << ARITH_INSHIFTER_FBYTESY_SHIFT)
       & ARITH_INSHIFTER_FBYTESY_MASK;
  t |= (ATON_SHIFT_ENCODE(conf->shift_y) << ARITH_INSHIFTER_FSHIFTY_SHIFT)
       & ARITH_INSHIFTER_FSHIFTY_MASK;
  t |= (conf->rounding_y  << ARITH_INSHIFTER_FROUNDY_SHIFT);
  t |= (conf->saturation_y << ARITH_INSHIFTER_FSATY_SHIFT);
  t |= (conf->round_mode_y << ARITH_INSHIFTER_FRNDMODEY_SHIFT)
       & ARITH_INSHIFTER_FRNDMODEY_MASK;
  t |= (conf->outbytes_y << ARITH_INSHIFTER_FOBYTESY_SHIFT)
       & ARITH_INSHIFTER_FOBYTESY_MASK;
  putreg32(t, base + ATON_ARITH_INSHIFTER);

  /* SHIFT register — V1 hardware (no V3 shift extension offset) */

  t = 0;
  t |= (conf->Ax_shift << ARITH_SHIFT_AX_SHIFT)
       & ARITH_SHIFT_AX_MASK;
  t |= (conf->By_shift << ARITH_SHIFT_BY_SHIFT)
       & ARITH_SHIFT_BY_MASK;
  t |= (conf->C_shift << ARITH_SHIFT_C_SHIFT)
       & ARITH_SHIFT_C_MASK;
  t |= (conf->shift_o << ARITH_SHIFT_RES_SHIFT)
       & ARITH_SHIFT_RES_MASK;
  putreg32(t, base + ATON_ARITH_SHIFT);

  /* COEFFAC register (scalar A and C) */

  t = ((uint32_t)(uint16_t)conf->A_scalar << ARITH_COEFFAC_A_SHIFT) |
      ((uint32_t)(uint16_t)conf->C_scalar << ARITH_COEFFAC_C_SHIFT);
  putreg32(t, base + ATON_ARITH_COEFFAC);

  /* COEFFB register (scalar B) */

  t = (uint32_t)(uint16_t)conf->B_scalar;
  putreg32(t, base + ATON_ARITH_COEFFB);

  /* CLIPRANGE (if enabled) */

  if (conf->clipout)
    {
      t = ((uint32_t)(uint16_t)conf->clipmin
           << ARITH_CLIPRANGE_CLIPMIN_SHIFT) |
          ((uint32_t)(uint16_t)conf->clipmax
           << ARITH_CLIPRANGE_CLIPMAX_SHIFT);
      putreg32(t, base + ATON_ARITH_CLIPRANGE);
    }

  /* Reset coefficient address */

  putreg32(0, base + ATON_ARITH_COEFFADDR);

  return 0;
}

/****************************************************************************
 * Name: LL_Switch_Init
 *
 * Description:
 *   Program STRSWITCH destination routing.
 *   First resets the switch, then programs DST registers.
 *
 ****************************************************************************/

int LL_Switch_Init(const LL_Switch_InitTypeDef *sw, int n)
{
  int i;
  uint32_t t;
  uintptr_t reg;

  /* Reset the switch: disable+clr+confclr */

  aton_disable_clr_confclr(ATON_STRSWITCH_BASE + ATON_STRSWITCH_CTRL);

  /* Enable switch */

  putreg32(ATON_STRSWITCH_CTRL_EN,
           ATON_STRSWITCH_BASE + ATON_STRSWITCH_CTRL);

  /* Program each routing entry */

  for (i = 0; i < n; i++)
    {
      reg = ATON_STRSWITCH_BASE + ATONN_DSTPORT_ID(sw[i].dest);

      t = 0;

      /* Context 0 */

      t |= ((sw[i].context0 != 0) << ATON_DST_EN0_SHIFT);
      t |= (ATONN_SRCPORT_ID(sw[i].source0) << ATON_DST_LINK0_SHIFT)
           & ATON_DST_LINK0_MASK;
      t |= ((uint32_t)sw[i].frames0 << ATON_DST_FNR0_SHIFT)
           & ATON_DST_FNR0_MASK;

      /* Context 1 */

      t |= ((sw[i].context1 != 0) << ATON_DST_EN1_SHIFT);
      t |= (ATONN_SRCPORT_ID(sw[i].source1) << ATON_DST_LINK1_SHIFT)
           & ATON_DST_LINK1_MASK;
      t |= ((uint32_t)sw[i].frames1 << ATON_DST_FNR1_SHIFT)
           & ATON_DST_FNR1_MASK;

      putreg32(t, reg);
    }

