ImBonkers/nuttx/arch/arm/src/stm32n6/stm32_aton_hw.c
  return 0;
}

/****************************************************************************
 * Name: LL_Switch_Deinit
 *
 * Description:
 *   Clear STRSWITCH destination routing entries.
 *
 ****************************************************************************/

int LL_Switch_Deinit(const LL_Switch_DeinitTypeDef *sw, int n)
{
  int i;

  for (i = 0; i < n; i++)
    {
      uintptr_t reg = ATON_STRSWITCH_BASE + ATONN_DSTPORT_ID(sw[i].dest);
      putreg32(0, reg);
    }

  return 0;
}

/****************************************************************************
 * Name: LL_ATON_EnableUnits_Init
 *
 * Description:
 *   Set EN bit in the CTRL register of each specified unit.
 *
 ****************************************************************************/

int LL_ATON_EnableUnits_Init(
    const LL_ATON_EnableUnits_InitTypeDef *units, int n)
{
  int i;
  uint32_t t;
  uintptr_t ctrl_addr;

  for (i = 0; i < n; i++)
    {
      enum AccelUnitsType utype = units[i].unit.unit_type;
      unsigned int uid = units[i].unit.unit_num;

      switch (utype)
        {
          case STRENG:
            ctrl_addr = ATON_STRENG_BASE(uid) + ATON_STRENG_CTRL;
            t = getreg32(ctrl_addr);
            t |= STRENG_CTRL_EN;
            putreg32(t, ctrl_addr);
            break;

          case CONVACC:

            /* Use saved ctrl bits to avoid reading back stale value */

            ctrl_addr = ATON_CONVACC_BASE(uid) + ATON_CONVACC_CTRL;
            putreg32(g_convacc_ctrl[uid] | CONVACC_CTRL_EN, ctrl_addr);
            break;

          case ARITH:
            ctrl_addr = ATON_ARITH_BASE(uid) + ATON_ARITH_CTRL;
            t = getreg32(ctrl_addr);
            t |= ARITH_CTRL_EN;
            putreg32(t, ctrl_addr);
            break;

          case POOL:
            ctrl_addr = ATON_POOL_BASE(uid) + 0x00;
            t = getreg32(ctrl_addr);
            t |= (1 << 0);  /* EN */
            putreg32(t, ctrl_addr);
            break;

          case DECUN:
            ctrl_addr = ATON_DECUN_BASE(uid) + 0x00;
            t = getreg32(ctrl_addr);
            t |= (1 << 0);  /* EN */
            putreg32(t, ctrl_addr);
            break;

          case ACTIV:
            ctrl_addr = ATON_ACTIV_BASE(uid) + 0x00;
            t = getreg32(ctrl_addr);
            t |= (1 << 0);  /* EN */
            putreg32(t, ctrl_addr);
            break;

          case RECBUF:
            ctrl_addr = ATON_RECBUF_BASE(uid) + 0x00;
            t = getreg32(ctrl_addr);
            t |= (1 << 0);  /* EN */
            putreg32(t, ctrl_addr);
            break;

          default:
            break;
        }
    }

  return 0;
}

/****************************************************************************
 * Name: LL_ATON_DisableUnits_Init
 *
 * Description:
 *   Disable each specified unit (CLR+CONFCLR) and turn off its clock gate.
 *
 ****************************************************************************/

int LL_ATON_DisableUnits_Init(
    const LL_ATON_DisableUnits_InitTypeDef *units, int n)
{
  int i;

  for (i = 0; i < n; i++)
    {
      enum AccelUnitsType utype = units[i].unit.unit_type;
      unsigned int uid = units[i].unit.unit_num;

      switch (utype)
        {
          case STRENG:
            aton_disable_clr_confclr(ATON_STRENG_BASE(uid) +
                                     ATON_STRENG_CTRL);
            LL_ATON_DisableClock(ATON_CLKB_STRENG(uid));
            break;

          case CONVACC:
            aton_disable_clr_confclr(ATON_CONVACC_BASE(uid) +
                                     ATON_CONVACC_CTRL);
            LL_ATON_DisableClock(ATON_CLKB_CONVACC(uid));
            break;

          case ARITH:
            aton_disable_clr_confclr(ATON_ARITH_BASE(uid) +
                                     ATON_ARITH_CTRL);
            LL_ATON_DisableClock(ATON_CLKB_ARITH(uid));
            break;

          case POOL:
            aton_disable_clr_confclr(ATON_POOL_BASE(uid) + 0x00);
            LL_ATON_DisableClock(ATON_CLKB_POOL(uid));
            break;

          case DECUN:
            aton_disable_clr_confclr(ATON_DECUN_BASE(uid) + 0x00);
            LL_ATON_DisableClock(ATON_CLKB_DECUN(uid));
            break;

          case ACTIV:
            aton_disable_clr_confclr(ATON_ACTIV_BASE(uid) + 0x00);
            LL_ATON_DisableClock(ATON_CLKB_ACTIV(uid));
            break;

          case RECBUF:
            aton_disable_clr_confclr(ATON_RECBUF_BASE(uid) + 0x00);
            LL_ATON_DisableClock(ATON_CLKB_RECBUF);
            break;

          default:
            return -1;
        }
    }

  return 0;
}

/****************************************************************************
 * Name: LL_Streng_Wait
 *
 * Description:
 *   Poll streaming engines until all engines in the bitmask have completed
 *   (RUNNING bit cleared in CTRL register).
 *
 ****************************************************************************/

int LL_Streng_Wait(uint32_t mask)
{
  int i;
  uint32_t running;

  do
    {
      running = 0;
      for (i = 0; i < ATON_STRENG_NUM; i++)
        {
          if (mask & (1u << i))
            {
              running |= getreg32(ATON_STRENG_BASE(i) + ATON_STRENG_CTRL)
                         & STRENG_CTRL_RUNNING;
            }
        }
    }
  while (running);

  return 0;
}

/****************************************************************************
 * Name: LL_ATON_Cache_MCU_Invalidate_Range
 *
 * Description:
 *   Invalidate MCU D-cache for an address range.
 *   Called from generated model code before output reads.
 *
 ****************************************************************************/

void LL_ATON_Cache_MCU_Invalidate_Range(uintptr_t addr, uint32_t size)
{
  up_invalidate_dcache(addr, addr + size);
}
